tutorials/fluidSolidInteraction/beamInCrossFlow/interElasticBeam/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidSolidInterface    Aitken;

AitkenCoeffs
{
    solidPatch interface;
    solidZone interface-zone;

    fluidPatch interface;
    fluidZone interface-zone;

    relaxationFactor 0.4;
    interfaceDeformationLimit 0;
    outerCorrTolerance 1e-3;
    nOuterCorr 20;
    coupled yes;
}


// ************************************************************************* //
